$(function () {
    $(".countMoney .o-invoice>label>input").click(function () {
        console.log($(this).prop("checked"))
        if ($(this).prop("checked")) {
            $(".o-invoice-item").css("display", "block");
        } else {
            $(".o-invoice-item").css("display", "none");
        }
    })
    var dingdan = $(".countMoney #order4").offset().top;
    $(document).scroll(function () {
        if ($(this).scrollTop() < dingdan) {
            $(".countMoney #order71").addClass("settle settle-fixed");
        } else {
            $(".countMoney #order71").removeClass("settle settle-fixed");
        }
        console.log($(".countMoney #order71").attr("class"))
    })
    // 新增地址
    $("#order1 .link").click(function () {
        $(".count-address,#myModal1").show()
        $(".countMoney").append("<div class='modal-backdrop fade in'></div>")
    })
    $(".control-group .controls .adrtag").click(function () {
        $(this).addClass("selected").siblings().removeClass("selected")
    })
    // 三级联动
    var iNum1;
    var iNum2;
    var city = ['北京', '上海', '天津', '重庆', '黑龙江', '河南', '山东', '河北', '吉林', '辽宁', '宁夏', '山西', '陕西', '安徽', '江苏', '浙江', '福建', '广东', '江西', '海南', '广西', '贵州', '湖南', '湖北', '四川', '云南', '西藏', '青海', '新疆'];
    var aCity = [['海淀区', '东城区', '西城区', '宣武区', '丰台区', '朝阳区', '崇文区', '大兴区', '石景山区', '门头沟区', '房山区', '通州区', '顺义区', '怀柔区', '昌平区', '平谷区', '密云县', '延庆县'],
    ['黄浦区', '卢湾区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '杨浦区', '虹口区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', '松江区', '青浦区', '南汇区', '奉贤区', '崇明县'],
    ['和平区', '河西区', '河北区', '河东区', '南开区', '红桥区', '北辰区', '津南区', '武清区', '塘沽区', '西青区', '汉沽区', '大港区', '宝坻区', '东丽区', '蓟县', '静海县', '宁河县'],
    ['渝中区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '万盛区', '双桥区', '渝北区', '巴南区', '万州区', '涪陵区', '黔江区', '长寿区', '江津区', '永川区', '南川区', '綦江县', '潼南县', '铜梁县', '大足县', '荣昌县', '璧山县', '垫江县', '武隆县', '丰都县', '城口县', '梁平县', '开县', '巫溪县', '巫山县', '奉节县', '云阳县', '忠县', '石柱土家族自治县', '彭水苗族土家族自治县', '酉阳苗族自治县', '秀山土家族苗族自治县'],
    ['哈尔滨市', '伊春市', '牡丹江市', '大庆市', '鸡西市', '鹤岗市', '绥化市', '齐齐哈尔市', '黑河市', '富锦市', '虎林市', '密山市', '佳木斯', '双鸭山市', '海林市', '铁力市', '北安市', '五大连池市', '阿城市', '尚志市', '五常市', '安达市', '七台河市', '绥芬河市', '双城市', '海伦市', '宁安市', '讷河市', '穆棱市', '同江市', '肇东市'],
    ['郑州市', '洛阳市', '焦作市', '商丘市', '信阳市', '周口市', '鹤壁市', '安阳市', '濮阳市', '驻马店市', '南阳市', '开封市', '漯河市', '许昌市', '新乡市', '济源市', '灵宝市', '偃师市', '邓州市', '登封市', '三门峡市', '新郑市', '禹州市', '巩义市', '永城市', '长葛市', '义马市', '林州市', '项城市', '汝州市', '荥阳市', '平顶山市', '卫辉市', '辉县市', '舞钢市', '新密市', '孟州市', '沁阳市', '郏县'],
    ['济南市', '青岛市', '威海市', '潍坊市', '菏泽市', '济宁市', '莱芜市', '东营市', '烟台市', '淄博市', '枣庄市', '泰安市', '临沂市', '日照市', '德州市', '聊城市', '滨州市', '乐陵市', '兖州市', '诸城市', '邹城市', '滕州市', '肥城市', '新泰市', '胶州市', '胶南市', '即墨市', '龙口市', '平度市', '莱西市'],
    ['石家庄市', '保定市', '唐山市', '邯郸市', '邢台市', '沧州市', '衡水市', '廊坊市', '承德市', '迁安市', '鹿泉市', '秦皇岛市', '南宫市', '任丘市', '叶城市', '辛集市', '涿州市', '定州市', '晋州市', '霸州市', '黄骅市', '遵化市', '张家口市', '沙河市', '三河市', '冀州市', '武安市', '河间市', '深州市', '新乐市', '泊头市', '安国市', '双滦区', '高碑店市'],
    ['长春市', '吉林市', '通化市', '白城市', '四平市', '辽源市', '松原市', '白山市', '集安市', '梅河口市', '双辽市', '延吉市', '九台市', '桦甸市', '榆树市', '蛟河市', '磐石市', '大安市', '德惠市', '洮南市', '龙井市', '珲春市', '公主岭市', '图们市', '舒兰市', '和龙市', '临江市', '敦化市'],
    ['沈阳市', '葫芦岛市', '大连市', '盘锦市', '鞍山市', '铁岭市', '本溪市', '丹东市', '抚顺市', '锦州市', '辽阳市', '阜新市', '调兵山市', '朝阳市', '海城市', '北票市', '盖州市', '凤城市', '庄河市', '凌源市', '开原市', '兴城市', '新民市', '大石桥市', '东港市', '北宁市', '瓦房店市', '普兰店市', '凌海市', '灯塔市', '营口市'],
    ['银川市', '固原市', '石嘴山市', '青铜峡市', '中卫市', '吴忠市', '灵武市'],
    ['太原市', '大同市', '阳泉市', '长治市', '临汾市', '晋中市', '运城市', '忻州市', '朔州市', '吕梁市', '古交市', '高平市', '永济市', '孝义市', '侯马市', '霍州市', '介休市', '河津市', '汾阳市', '原平市', '潞城市'],
    ['西安市', '咸阳市', '榆林市', '宝鸡市', '铜川市', '渭南市', '汉中市', '安康市', '商洛市', '延安市', '韩城市', '兴平市', '华阴市'],
    ['合肥市', '毫州市', '芜湖市', '马鞍山市', '池州市', '黄山市', '滁州市', '安庆市', '淮南市', '淮北市', '蚌埠市', '巢湖市', '宿州市', '宣城市', '六安市', '阜阳市', '铜陵市', '明光市', '天长市', '宁国市', '界首市', '桐城市'],
    ['南京市', '无锡市', '常州市', '扬州市 ', '徐州市', '苏州市', '连云港市', '盐城市', '淮安市', '宿迁市', '镇江市', '南通市', '泰州市', '兴化市', '东台市', '常熟市', '江阴市', '张家港市', '通州市', '宜兴市', '邳州市', '海门市', '大丰市', '溧阳市', '泰兴市', '昆山市', '启东市', '江都市', '丹阳市', '吴江市', '靖江市', '扬中市', '新沂市', '仪征市', '太仓市', '姜堰市', '高邮市', '金坛市', '句容市', '灌南县'],
    ['杭州市', '宁波市', '绍兴市', '温州市', '台州市', '湖州市', '嘉兴市', '金华市', '舟山市', '衢州市', '丽水市', '余姚市', '乐清市', '临海市', '温岭市', '永康市', '瑞安市', '慈溪市', '义乌市', '上虞市', '诸暨市', '海宁市', '桐乡市', '兰溪市', '龙泉市', '建德市', '富德市', '富阳市', '平湖市', '东阳市', '东阳市', '嵊州市', '奉化市', '临安市', '江山市'],
    ['福州市', '厦门市', '泉州市', '漳州市', '南平市', '三明市', '龙岩市', '莆田市', '宁德市', '建瓯市', '武夷山市', '长乐市', '福清市', '晋江市', '南安市', '福安市', '龙海市', '邵武市', '石狮市', '福鼎市', '建阳市', '漳平市', '永安市'],
    ['广州市', '深圳市', '珠海市', '汕头市', '佛山市', '韶关市', '湛江市', '肇庆市', '江门市', '茂名市', '惠州市', '梅州市', '汕尾市', '河源市', '阳江市', '清远市', '东莞市', '中山市', '潮州市', '揭阳市', '云浮市'],
    ['南昌市', '赣州市', '上饶市', '宜春市', '景德镇市', '亲余市', '九江市', '萍乡市', '抚州市', '鹰潭市', '吉安市', '丰城市', '樟树市', '德兴市', '瑞金市', '井冈山市', '高安市', '乐平市', '南康市', '贵溪市', '瑞昌市', '东乡县', '广丰县', '信州区', '三清山'],
    ['海口市', '三亚市', '万宁市', '文昌市', '儋州市', '琼海市', '东方市', '五指山市'],
    ['南宁市', '贺州市', '玉林市', '桂林市', '柳州市', '梧州市', '北海市', '钦州市', '百色市', '防城港市', '贵港市', '河池市', '崇左市', '来宾市', '东兴市', '桂平市', '北流市', '岑溪市', '合山市', '凭祥市', '宜州市'],
    ['贵阳市', '安顺市', '遵义市', '六盘水市', '兴义市', '都匀市', '凯里市', '毕节市', '清镇市', '铜仁市', '赤水市', '仁怀市', '福泉市'],
    ['长沙市', '郴州市', '益阳市', '娄底市', '株洲市', '衡阳市', '湘潭市', '岳阳市', '常德市', '邵阳市', '永州市', '张家界市', '怀化市', '浏阳市', '醴陵市', '湘乡市', '耒阳市', '沅江市', '涟源市', '常宁市', '吉首市', '冷水江市', '临湘市', '汨罗市', '武冈市', '韶山市', '安化县湘西州'],
    ['武汉市', '荆门市', '咸宁市', '襄樊市', '荆州市', '黄石市', '宜昌市', '随州市', '鄂州市', '孝感市', '黄冈市', '十堰市', '枣阳市', '老河口市', '恩施市', '仙桃市', '天门市', '钟祥市', '潜江市', '麻城市', '洪湖市', '汉川市', '赤壁市', '松滋市', '丹江口市', '武穴市', '广水市', '石首市', '大冶市', '枝江市', '应城市', '宜城市', '当阳市', '安陆市', '宜都市', '利川市'],
    ['昆明市', '玉溪市', '大理市', '曲靖市', '昭通市', '保山市', '丽江市', '临沧市', '楚雄市', '开远市', '个旧市', '景洪市', '安宁市', '宣威市'],
    ['拉萨市', '日喀则市'],
    ['西宁市', '格尔木市', '德令哈市'],
    ['乌鲁木齐市', '石河子市', '喀什市', '阿勒泰市', '阜康市', '库尔勒市', '阿克苏市', '阿拉尔市哈密市']];
    var aCountry = [[['海淀区'], ['东城区'], ['西城区'], ['宣武区'], ['丰台区'], ['朝阳区'], ['崇文区'], ['大兴区'], ['石景山区'], ['门头沟区'], ['房山区'], ['通州区'], ['顺义区'], ['怀柔区'], ['昌平区'], ['平谷区'], ['密云县'], ['延庆县']],
    [['黄浦区'], ['卢湾区'], ['徐汇区'], ['长宁区'], ['静安区'], ['普陀区'], ['闸北区'], ['杨浦区'], ['虹口区'], ['闵行区'], ['宝山区'], ['嘉定区'], ['浦东新区'], ['金山区'], ['松江区'], ['青浦区'], ['南汇区'], ['奉贤区'], ['崇明县']],
    [['和平区'], ['河西区'], ['河北区'], ['河东区'], ['南开区'], ['红桥区'], ['北辰区'], ['津南区'], ['武清区'], ['塘沽区'], ['西青区'], ['汉沽区'], ['大港区'], ['宝坻区'], ['东丽区'], ['蓟县'], ['静海县'], ['宁河县']],
    [['渝中区'], ['大渡口区'], ['江北区'], ['沙坪坝区'], ['九龙坡区'], ['南岸区'], ['北碚区'], ['万盛区'], ['双桥区'], ['渝北区'], ['巴南区'], ['万州区'], ['涪陵区'], ['黔江区'], ['长寿区'], ['江津区'], ['永川区'], ['南川区'], ['綦江县'], ['潼南县'], ['铜梁县'], ['大足县'], ['荣昌县'], ['璧山县'], ['垫江县'], ['武隆县'], ['丰都县'], ['城口县'], ['梁平县'], ['开县'], ['巫溪县'], ['巫山县'], ['奉节县'], ['云阳县'], ['忠县'], ['石柱土家族自治县'], ['彭水苗族土家族自治县'], ['酉阳苗族自治县'], ['秀山土家族苗族自治县']],
    [['哈尔滨市'], ['伊春市'], ['牡丹江市'], ['大庆市'], ['鸡西市'], ['鹤岗市'], ['绥化市'], ['齐齐哈尔市'], ['黑河市'], ['富锦市'], ['虎林市'], ['密山市'], ['佳木斯'], ['双鸭山市'], ['海林市'], ['铁力市'], ['北安市'], ['五大连池市'], ['阿城市'], ['尚志市'], ['五常市'], ['安达市'], ['七台河市'], ['绥芬河市'], ['双城市'], ['海伦市'], ['宁安市'], ['讷河市'], ['穆棱市'], ['同江市'], ['肇东市']],
    [['郑州市'], ['洛阳市'], ['焦作市'], ['商丘市'], ['信阳市'], ['周口市'], ['鹤壁市'], ['安阳市'], ['濮阳市'], ['驻马店市'], ['南阳市'], ['开封市'], ['漯河市'], ['许昌市'], ['新乡市'], ['济源市'], ['灵宝市'], ['偃师市'], ['邓州市'], ['登封市'], ['三门峡市'], ['新郑市'], ['禹州市'], ['巩义市'], ['永城市'], ['长葛市'], ['义马市'], ['林州市'], ['项城市'], ['汝州市'], ['荥阳市'], ['平顶山市'], ['卫辉市'], ['辉县市'], ['舞钢市'], ['新密市'], ['孟州市'], ['沁阳市'], ['郏县']],
    [['济南市'], ['青岛市'], ['威海市'], ['潍坊市'], ['菏泽市'], ['济宁市'], ['莱芜市'], ['东营市'], ['烟台市'], ['淄博市'], ['枣庄市'], ['泰安市'], ['临沂市'], ['日照市'], ['德州市'], ['聊城市'], ['滨州市'], ['乐陵市'], ['兖州市'], ['诸城市'], ['邹城市'], ['滕州市'], ['肥城市'], ['新泰市'], ['胶州市'], ['胶南市'], ['即墨市'], ['龙口市'], ['平度市'], ['莱西市']],
    [['石家庄市'], ['保定市'], ['唐山市'], ['邯郸市'], ['邢台市'], ['沧州市'], ['衡水市'], ['廊坊市'], ['承德市'], ['迁安市'], ['鹿泉市'], ['秦皇岛市'], ['南宫市'], ['任丘市'], ['叶城市'], ['辛集市'], ['涿州市'], ['定州市'], ['晋州市'], ['霸州市'], ['黄骅市'], ['遵化市'], ['张家口市'], ['沙河市'], ['三河市'], ['冀州市'], ['武安市'], ['河间市'], ['深州市'], ['新乐市'], ['泊头市'], ['安国市'], ['双滦区'], ['高碑店市']],
    [['长春市'], ['吉林市'], ['通化市'], ['白城市'], ['四平市'], ['辽源市'], ['松原市'], ['白山市'], ['集安市'], ['梅河口市'], ['双辽市'], ['延吉市九'], ['台市'], ['桦甸市'], ['榆树市'], ['蛟河市'], ['磐石市'], ['大安市'], ['德惠市'], ['洮南市'], ['龙井市'], ['珲春市'], ['公主岭市'], ['图们市'], ['舒兰市'], ['和龙市'], ['临江市'], ['敦化市']],
    [['沈阳市'], ['葫芦岛市'], ['大连市'], ['盘锦市'], ['鞍山市'], ['铁岭市'], ['本溪市'], ['丹东市'], ['抚顺市'], ['锦州市'], ['辽阳市'], ['阜新市'], ['调兵山市'], ['朝阳市'], ['海城市'], ['北票市'], ['盖州市'], ['凤城市'], ['庄河市'], ['凌源市'], ['开原市'], ['兴城市'], ['新民市'], ['大石桥市'], ['东港市'], ['北宁市'], ['瓦房店市'], ['普兰店市'], ['凌海市'], ['灯塔市'], ['营口市']],
    [['银川市'], ['固原市'], ['石嘴山市'], ['青铜峡市'], ['中卫市'], ['吴忠市'], ['灵武市']],
    [['太原市'], ['大同市'], ['阳泉市'], ['长治市'], ['临汾市'], ['晋中市'], ['运城市'], ['忻州市'], ['朔州市'], ['吕梁市'], ['古交市'], ['高平市'], ['永济市'], ['孝义市'], ['侯马市'], ['霍州市'], ['介休市'], ['河津市'], ['汾阳市'], ['原平市'], ['潞城市']],
    [['西安市'], ['咸阳市'], ['榆林市'], ['宝鸡市'], ['铜川市'], ['渭南市'], ['汉中市'], ['安康市'], ['商洛市'], ['延安市'], ['韩城市'], ['兴平市'], ['华阴市']],
    [['合肥市'], ['毫州市'], ['芜湖市'], ['马鞍山市'], ['池州市'], ['黄山市'], ['滁州市'], ['安庆市'], ['淮南市'], ['淮北市'], ['蚌埠市'], ['巢湖市'], ['宿州市'], ['宣城市'], ['六安市'], ['阜阳市'], ['铜陵市'], ['明光市'], ['天长市'], ['宁国市'], ['界首市'], ['桐城市']],
    [['南京市'], ['无锡市'], ['常州市'], ['扬州市'], ['徐州市'], ['苏州市'], ['连云港市'], ['盐城市'], ['淮安市'], ['宿迁市'], ['镇江市'], ['南通市'], ['泰州市'], ['兴化市'], ['东台市'], ['常熟市'], ['江阴市'], ['张家港市'], ['通州市'], ['宜兴市'], ['邳州市'], ['海门市'], ['大丰市'], ['溧阳市'], ['泰兴市'], ['昆山市'], ['启东市'], ['江都市'], ['丹阳市'], ['吴江市'], ['靖江市'], ['扬中市'], ['新沂市'], ['仪征市'], ['太仓市'], ['姜堰市'], ['高邮市'], ['金坛市'], ['句容市'], ['灌南县']],
    [['杭州市'], ['宁波市'], ['绍兴市'], ['温州市'], ['台州市'], ['湖州市'], ['嘉兴市'], ['金华市'], ['舟山市'], ['衢州市'], ['丽水市'], ['余姚市'], ['乐清市'], ['临海市'], ['温岭市'], ['永康市'], ['瑞安市'], ['慈溪市'], ['义乌市'], ['上虞市'], ['诸暨市'], ['海宁市'], ['桐乡市'], ['兰溪市'], ['龙泉市'], ['建德市'], ['富德市'], ['富阳市'], ['平湖市'], ['东阳市'], ['东阳市'], ['嵊州市'], ['奉化市'], ['临安市'], ['江山市']],
    [['福州市'], ['厦门市'], ['泉州市'], ['漳州市'], ['南平市'], ['三明市'], ['龙岩市'], ['莆田市'], ['宁德市'], ['建瓯市'], ['武夷山市'], ['长乐市'], ['福清市'], ['晋江市'], ['南安市'], ['福安市'], ['龙海市'], ['邵武市'], ['石狮市'], ['福鼎市'], ['建阳市'], ['漳平市'], ['永安市']],
    [['广州市'], ['深圳市'], ['珠海市'], ['汕头市'], ['佛山市'], ['韶关市'], ['湛江市'], ['肇庆市'], ['江门市'], ['茂名市'], ['惠州市'], ['梅州市'], ['汕尾市'], ['河源市'], ['阳江市'], ['清远市'], ['东莞市'], ['中山市'], ['潮州市'], ['揭阳市'], ['云浮市']],
    [['南昌市'], ['赣州市'], ['上饶市'], ['宜春市'], ['景德镇市'], ['亲余市'], ['九江市'], ['萍乡市'], ['抚州市'], ['鹰潭市'], ['吉安市'], ['丰城市'], ['樟树市'], ['德兴市'], ['瑞金市'], ['井冈山市'], ['高安市'], ['乐平市'], ['南康市'], ['贵溪市'], ['瑞昌市'], ['东乡县'], ['广丰县'], ['信州区'], ['三清山']],
    [['海口市'], ['三亚市'], ['万宁市'], ['文昌市'], ['儋州市'], ['琼海市'], ['东方市'], ['五指山市']],
    [['南宁市'], ['贺州市'], ['玉林市'], ['桂林市'], ['柳州市'], ['梧州市'], ['北海市'], ['钦州市'], ['百色市'], ['防城港市'], ['贵港市'], ['河池市'], ['崇左市'], ['来宾市'], ['东兴市'], ['桂平市'], ['北流市'], ['岑溪市'], ['合山市'], ['凭祥市'], ['宜州市']],
    [['贵阳市'], ['安顺市'], ['遵义市'], ['六盘水市'], ['兴义市'], ['都匀市'], ['凯里市'], ['毕节市'], ['清镇市'], ['铜仁市'], ['赤水市'], ['仁怀市'], ['福泉市']],
    [['长沙市'], ['郴州市'], ['益阳市'], ['娄底市'], ['株洲市'], ['衡阳市'], ['湘潭市'], ['岳阳市'], ['常德市'], ['邵阳市'], ['永州市'], ['张家界市'], ['怀化市'], ['浏阳市'], ['醴陵市'], ['湘乡市'], ['耒阳市'], ['沅江市'], ['涟源市'], ['常宁市'], ['吉首市'], ['冷水江市'], ['临湘市'], ['汨罗市'], ['武冈市'], ['韶山市'], ['安化县湘西州']],
    [['武汉市'], ['荆门市'], ['咸宁市'], ['襄樊市'], ['荆州市'], ['黄石市'], ['宜昌市'], ['随州市'], ['鄂州市'], ['孝感市'], ['黄冈市'], ['十堰市'], ['枣阳市'], ['老河口市'], ['恩施市'], ['仙桃市'], ['天门市'], ['钟祥市'], ['潜江市'], ['麻城市'], ['洪湖市'], ['汉川市'], ['赤壁市'], ['松滋市'], ['丹江口市'], ['武穴市'], ['广水市'], ['石首市'], ['大冶市'], ['枝江市'], ['应城市'], ['宜城市'], ['当阳市'], ['安陆市'], ['宜都市'], ['利川市']],
    [['昆明市'], ['玉溪市'], ['大理市'], ['曲靖市'], ['昭通市'], ['保山市'], ['丽江市'], ['临沧市'], ['楚雄市'], ['开远市'], ['个旧市'], ['景洪市'], ['安宁市'], ['宣威市']],
    [['拉萨市'], ['日喀则市']],
    [['西宁市'], ['格尔木市'], ['德令哈市']],
    [['乌鲁木齐市'], ['石河子市'], ['喀什市'], ['阿勒泰市'], ['阜康市'], ['库尔勒市'], ['阿克苏市'], ['阿拉尔市哈密市']]];

    for (var i = 0; i < city.length; i++) {
        $('#ProvinceId').append('<option>' + city[i] + '</option>');
    };
    $('#ProvinceId').change(function () {
        $('#AreaId').children().not(':eq(0)').remove();
        $('#DistrictId').children().not(':eq(0)').remove();
        iNum1 = $(this).children('option:selected').index();
        var aaCity = aCity[iNum1 - 1];
        for (var j = 0; j < aaCity.length; j++) {
            $('#AreaId').append('<option>' + aaCity[j] + '</option>');
        }
    });
    $('#AreaId').change(function () {
        $('#DistrictId').children().not(':eq(0)').remove();
        iNum2 = $(this).children('option:selected').index();
        var aaCountry = aCountry[iNum1 - 1][iNum2 - 1];
        for (var k = 0; k < aaCountry.length; k++) {
            $('#DistrictId').append('<option>' + aaCountry[k] + '</option>');
        }
    })
    //关闭地址
    $(".count-address .modal-header .close").click(function () {
        $(".count-address,.modal-backdrop").css("display", "none");
    })
    // 保存地址
    $("#btnSaveConsignee").click(function () {
        // 姓名必填
        if ($("#ConsigneeName").val() == "") {
            $("#ConsigneeName").siblings(".error").show();
        } else {
            var name = $("#ConsigneeName").val();
            $("#ConsigneeName").siblings(".error").hide();
        }
        // 手机号必填
        if ($("#ConsigneeMobile").val() == "") {
            $("#ConsigneeMobile").siblings(".error").show();
        } else {
            var pnumber = $("#ConsigneeMobile").val();
            $("#ConsigneeMobile").siblings(".error").hide();
        }
        // 详细地址必填
        if ($("#ConsigneeAddress").val() == "") {
            $("#ConsigneeAddress").siblings(".error").show();
        } else {
            var detailaddress = $("#ConsigneeAddress").val();
            $("#ConsigneeAddress").siblings(".error").hide();
        }
        // 地址类型必填
        if (!$(".controls .adrtag").hasClass("selected")) {
            $(".controls .adrtag").siblings(".error").css("display", "inline");
        } else {
            var type = $(".controls .selected").text().slice(0, 2);
            $(".controls .adrtag").siblings(".error").css("display", "none");
        }
        // 城市必填
        if ($("#AreaId").val() == "") {
            $("#AreaId").next().show();
        } else {
            var city = $("#AreaId").val();
            $("#AreaId").next().hide();
        }
        // 市区必填
        if ($("#DistrictId").val() == "") {
            $("#DistrictId").next().show();
        } else {
            var xian = $("#DistrictId").val();
            $("#DistrictId").next().hide();
        }
        if (!$("#DistrictId").val() == "" && !$("#AreaId").val() == "" && $(".controls .adrtag").hasClass("selected") && !$("#ConsigneeAddress").val() == "" && !$("#ConsigneeMobile").val() == "" && !$("#ConsigneeName").val() == "") {
            $(".count-address,.modal-backdrop").hide();
            var city = $("#AreaId").val();
            $(".countMoney .receive1").append(`
                <li>
                    <label class="selected">
                        <input type="radio" name="receive">
                        <span class="adrtag">${type}</span>
                        <strong>${name}</strong>
                        <span>${city}${xian}${detailaddress}，${pnumber}</span>
                        <span style="display:none;" class="orange">此地址尚不支持配送，请选择其他地址</span>
                        <a href="###" class="btn-setdefault">设为默认地址</a>
                        <a href="#myModal1" class="btn-edit">编辑</a>
                        <a href="###" class="btn-del">删除</a>
                        <b></b>
                    </label>
                </li>  
            `)
            $(".selected .btn-del").click(function () {
                $(this).parent().parent().remove()
            })
            $(".selected .btn-setdefault").click(function () {
                $(this).parent().parent().addClass("selected")
            })
            // 删除地址
            $(".countMoney .receive1 .btn-del").click(function () {
                $(this).parent().parent().remove()
            })
            if ($(".countMoney .receive1").children().length > 0) {
                var time=new Date();
                var tian=time.getDate()+1;
                var Month_day=time.getMonth()+1+"-"+tian;
                var day=time.getDay()+1;
                if(day==1) {
                    day="一";
                }else if(day==2) {
                    day="二";
                }else if(day==3) {
                    day="三";
                }else if(day==4) {
                    day="四";
                }else if(day==5) {
                    day="五";
                }else if(day==6) {
                    day="六";
                }else if(day==7) {
                    day="日";
                }else {
                    day="一";
                }
                $("#order2").children(".o-delivery").remove();
                $("#order2").append(`
                <table class="table">
                    <thead>             
                        <tr>
                            <th>收货时间</th>
                            <th>运费</th>
                            <th>配送方式</th>
                            <th>备注</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td>
                                <a href="#myModal2" class="selected" id="theDeliveryDate">星期${day} ${Month_day} 全天09:00-21:00</a>
                                <span id="theSelectedDeliveryDate" style="display:none;">2019-10-22</span>
                                <span id="theSelectedPeriod" style="display:none;">0</span>
                                <span id="theDeliveryMethod" style="display:none;">合作方快递</span>
                         </td>  
                         <td>
                            <span id="serverFreight">10</span>&nbsp;</td>
                            <td>合作方快递</td>
                            <td>可配送至全国大部分区域</td>
                        </tr>
                    </tbody>
                </table>
                
                `)
                $("#theDeliveryDate").click(function() {
                    $(".msg-shadow,#myModal2").show();
                    for(var i=0;i<8;i++) {
                        var shijian=new Date();
                        var time1=shijian.getDate()+i;
                        var month=shijian.getMonth()+1+"-"+time1;
                        day=shijian.getDay()+i+1;
                        if(day>7) {
                            day=1;
                        }
                        if(day==1) {
                            day="一";
                        }else if(day==2) {
                            day="二";
                        }else if(day==3) {
                            day="三";
                        }else if(day==4) {
                            day="四";
                        }else if(day==5) {
                            day="五";
                        }else if(day==6) {
                            day="六";
                        }else if(day==7) {
                            day="日";
                        } 
                        tian++;
                        Month_day=Month_day.slice(0,4)+tian;
                        $("#myModal2 .table thead").append(`
                        <th>
                            星期${day}
                            <br>
                            ${Month_day}
                        </th>
                        `)
                    }
                })
                $(".modal-header .close").click(function() {
                    $(".msg-shadow,#myModal2").hide()
                })
            }
        }
    })
    // 地址input框键入时判断 
    $("#ConsigneeName,#ConsigneeMobile,#ConsigneeAddress,#AreaId,#DistrictId").change(function () {
        if ($(this).val() == "") {
            $(this).siblings(".error").show()
        } else {
            $(this).siblings(".error").hide()
        }
    })
    text = JSON.parse(localStorage.list)
    var total_pricef=0
    for(var i=0;i<text.length;i++){
        $(".f-tbody").append(
            `
            <tr>
                <td>${text[i].title}
                    <p class="gray2">不支持7天无理由退货</p>
                </td>
                <td>${text[i].money}</td>
                <td>${text[i].num}</td>
                <td></td>
                <td>${text[i].money.slice(1,)*text[i].num}</td>
            </tr>
            `
        )
    }
})